In [3]:
import pandas as pd
import pandasql
sql=pandasql.sqldf

In [6]:
!ls ./data

query_one.csv

In [7]:
q1=pd.read_csv('data/query_one.csv')

In [9]:
q1.head()

   user_id          page  unix_timestamp
0     6684     home_page      1451640067
1     8098     home_page      1451647141
2     9440     home_page      1451653638
3     1003     home_page      1451611211
4     4272  product_page      1451628024

In [24]:
sql('select * from q1 order by unix_timestamp desc limit 10')

   user_id       page  unix_timestamp
0    10000     search      1451656385
1    10000  home_page      1451656370
2     9995  home_page      1451656364
3     9994  home_page      1451656363
4     9993  home_page      1451656351
5     9992     search      1451656349
6     9992  home_page      1451656348
7     9990     search      1451656344
8     9990  home_page      1451656338
9     9989  home_page      1451656331